import { Container, Typography } from '@mui/material'
import React from 'react'


function Home() {
  return (
    <div>
      <Container component="main" 
                                maxWidth="xl"
                                sx={{
                                        mt: 5,
                                        mb: 2,
                                        p: 2,
                                        boxShadow: 3,
                                        bgcolor: '#E3E3E3'
                                }}>
          <Typography textAlign= 'center' sx={{pb:2}}>Requirements</Typography>

          <Typography textAlign= 'center' color="secondary" >
             
          ระบบทุนการศึกษา เป็นระบบที่เปิดโอกาสให้นักศึกษาที่ประสงค์มาขอรับทุนการศึกษา 
          และนักศึกษาสามารถเข้ามาดูข้อทูลทุนการศึกษาหรือรายละเอียดการสมัครทุนการศึกษาต่างๆ 
          และสามารถส่งคำร้องขอรับทุนที่นักศึกษาสนใจ แล้วทางระบบจะทำการพิจารณา และมอบทุนแก่นักศึกษา
          นอกจากนี้ระบบจะให้นักศึกษาที่เข้าใช้งานระบบครั้งแรกจะต้องลงทะเบียนก่อน 
          จากนั้นระบบจะแสดงหน้าให้นักศึกษากรอกข้อมูลของนักศึกษา  อาจารย์ที่ปรึกษา สำนักวิชา และปีการศึกษาที่จะสมัคร 
          แต่ถ้าหากนักศึกษาเคยมีการลงทะเบียนไว้แล้ว นักศึกษาสามาถเข้าสู่ระบบไปดูข้อมูลทุนการศึกษาได้เลย 
          อีกทั้งนักศึกษาสามารถมาแก้ไขหรือดูประวัติของนักศึกษาได้

          </Typography>   
      </Container>

<Container component="main"
        maxWidth="xl"
        sx={{
          mt: 5,
          mb: 2,
          p: 2,
          boxShadow: 3,
          bgcolor: '#E3E3E3'
        }}>
        <Typography textAlign='center' sx={{ pb: 2 }}>Requirements</Typography>

        <Typography textAlign='center' color="secondary" >
          ระบบทุนการศึกษา เป็นระบบที่ช่วยให้นักศึกษาที่กำลังศึกษาต่อได้ทุนในการต่อยอดความรู้ หรือช่วยแบ่งเบาภาระค่าใช้จ่ายให้กับนักศึกษาที่ขาดแคลนทุนทรัพย์
          ในส่วนระบบลงทะเบียนทุนการศึกษามหาวิทยาลัย เป็นระบบที่ให้ผู้ใช้ระบบซึ่งเป็นนักศึกษามหาวิทยาลัย Login เข้าสู่ระบบลงทะเบียนทุนการศึกษา 
          เพื่อทำการยื่นคำร้องขอทุนการศึกษา โดยให้นักศึกษาใส่รายละเอียดต่างๆ ของนักศึกษาที่จะขอทุนได้แก่ ทุนการศึกษาการศึกษาที่นักศึกษาขอ ข้อมูลของนักศึกษา 
          สาขาวิชาของนักศึกษา และประเภทการขอทุน ของนักศึกษาเพื่อเป็นข้อมูลที่ใช้ในการพิจารณาอนุมัติทุน

        </Typography>

      </Container>

    </div>
  )
}

export default Home